loadtest/vibe-search.yaml
config:
  target: 'http://localhost:3004'
  phases:
    - duration: 60
      arrivalRate: 15
  payload:
    path: 'bands.csv'
    fields:
      - band
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - flow:
      - post:
          url: '/hitlist/search'
          json:
            searchString: '{{ band }}'